Repository: Trinithea/Cepheus
Catalog: CepheusProjectWpf/Properties/Resources.*.resx
Languages: cs_cz

# About
source: About Cepheus
cs_cz: O aplikaci Cepheus

# AddedToMinSpTree
source: added to minimum spanning tree.
cs_cz: je přidaná do minimální kostry.

source: added with reserve
cs_cz: je přidaná s rezervou

source: and surplus:
cs_cz: a přebytek:

# AttemptToRun
source: attempts to run...
cs_cz: se snaží spustit...

# BFAlgo
source: Bellman-Ford's algorithm
cs_cz: Bellman-Fordův algoritmus

# BFSAlgo
source: Breadth-first search
cs_cz: Prohledávání do šířky

# BoruvkaAlgo
source: Boruvka's algorithm
cs_cz: Borůvkův algoritmus

# BracketsHeight
source: In brackets after name of a vertex you see its height.
cs_cz: V závorkách za jménem vrcholu uvidíte jeho výšku.

# CantWrite
source: Can't write to the selected file. Please check if the file is closed.
cs_cz: Zápis do souboru nemůže být proveden. Zkontrolujte, že je soubor zavřený.

# ChooseAlgo
source: You have to choose an algorithm in the upper left corner corner.
cs_cz: Musíte nejprve vlevo nahoře zvolit z nabídky algoritmus, který chcete spustit.

# CleaningReserveNet
source: Cleaning the network of reserves...
cs_cz: Čištění sítě rezerv…

# ClearCanvas.Content
source: Clear canvas
cs_cz: Vyčisti plátno

source: Closed
cs_cz: Uzavřený

# CloseTime
source: has been closed in time:
cs_cz: byl uzavřen v čase:

source: Common graphs
cs_cz: Grafy z Průvodce labyrintem algoritmů

# ConstructingPath
source: Constructing the path from source to sink...
cs_cz: Konstrukce cesty ze zdroje ke stoku…

# ContextComponentInicialized
source: Context components are inicialized.
cs_cz: Komponenty souvislosti jsou inicializovány.

# ContextComponentsMerging
source: Context components are merging...
cs_cz: Slévání komponent souvislosti…

# Continue
source: Please, press Done button to continue. The flow from edges will be removed.
cs_cz: Abyste mohli pokračovat, stiskněte prosím Hotovo. Pak se smaže tok z hran.

# CreatingReserveNet
source: Creating the network of reserves...
cs_cz: Vytváření sítě rezerv…

source: Cursor
cs_cz: Kurzor

source: Czech
cs_cz: Čeština

source: Default color
cs_cz: Základní barva

# Dequed
source: has been dequeued.
cs_cz: byl odebrán z fronty.

# Desc
source: Description of algorithm
cs_cz: Popis algoritmu

# DFSAlgo
source: Depth-first search
cs_cz: Prohledávání do hloubky

# DijkstraAlgo
source: Dijkstra's algorithm with binary heap
cs_cz: Dijsktrův algoritmus s binární haldou

# DijkstraPosLengths
source: In Dijkstra's algorithm can be only positive lengths. Please, correct all negative lengths and then press Run again.
cs_cz: může obsahovat pouze nezáporné délky hran. Opravte tedy všechny záporné délky a znovu stiskněte Spustit.

# DinicAlgo
source: Dinic's algorithm
cs_cz: Dinicův algoritmus

# DividingVertices
source: Dividing vertices to layers according to their distance from the source...
cs_cz: Rozdělení vcholů na vrstvy dle vzdálenosti od zdroje…

source: Done
cs_cz: Hotovo

# EdgesInicialized
source: Edges are initialized...
cs_cz: Inicializace hran…

source: English
cs_cz: Angličtina

# Enqued
source: has been enqueued.
cs_cz: byl přidán do fronty.

source: Error
cs_cz: Chyba

# FFAlgo
source: Ford-Fulkerson's algorithm
cs_cz: Ford-Fulkersonův algoritmus

# FileEmpty
source: The file is empty.
cs_cz: Soubor je prázdný.

source: Fill color
cs_cz: Vyplnit barvou

# FromInitVPred
source: from initial vertex with predecessor
cs_cz: od počátečního vrcholu s předchůdcem

# FWAlgo
source: Floyd-Warshall's algorithm
cs_cz: Floyd-Warshallův algoritmus

# GoldbergAlgo
source: Goldberg's algorithm
cs_cz: Goldbergův algoritmus

source: has finished.
cs_cz: skončil.

source: has height:
cs_cz: má výšku:

source: has ID:
cs_cz: má ID:

source: has state:
cs_cz: je

source: Highlight color
cs_cz: Zvýrazňující barva

# Import
source: Open graph
cs_cz: Otevřít graf

# ImproveFlow
source: Improving the flow...
cs_cz: Zlepšování toku…

# IncorrectFormat
source: File has an incorrect format.
cs_cz: Soubor má špatný formát.

source: Inside
cs_cz: Uvnitř

# IsInComp
source: is in component:
cs_cz: je v komponentě:

# IsInDistance
source: and is in distance:
cs_cz: a je ve vzdálenosti:

# JarnikAlgo
source: Jarnik's algorithm
cs_cz: Jarníkův algoritmus

# KruskalAlgo
source: Kruskal's algorithm
cs_cz: Kruskalův algoritmus

# LowestReserve
source: The lowest reserve is
cs_cz: Nejmenší z rezerv je

# MarkingSurplus
source: Marking vertices with positive surplus...
cs_cz: Označování vrcholů s kladným přebytkem…

# MatrixDist
source: Matrix of distances:
cs_cz: Matice vzdáleností:

# MaxFlow
source: The maximum flow in this network is:
cs_cz: Maximální tok v této síti je:

# Mistake
source: Some mistake occured...
cs_cz: Objevila se nějaká chyba...

source: Neighbour
cs_cz: Soused

source: Net of reserves
cs_cz: Síť rezerv

# NLEdgeSpace
source: Edge
cs_cz: Hrana

# NLTransfering
source: Transfering
cs_cz: Převádění

# NLVertexSpace
source: Vertex
cs_cz: Vrchol

# NonAlgoSelected
source: No algorithm is selected.
cs_cz: Není vybrán žádný algoritmus.

source: None
cs_cz: Žádný

# NothingTransfered
source: Nothing was transfered.
cs_cz: Nic nebylo převedeno.

source: of the edge
cs_cz: hrany

source: on edge
cs_cz: hranou

# OnlyInteger
source: Only integer length of an edge is acceptable...
cs_cz: Hrana může mít pouze celočíselnou délku…

source: Open
cs_cz: Otevřený

# OpenTime
source: has been opened in time:
cs_cz: byl otevřen v čase:

# OpenVerticesSorted
source: Open vertices in sorted order (distance is in brackets):
cs_cz: Otevřené vrcholy v setříděném pořadí (jejich vzdálenost je v závorkách):

# OutEdgesSorted
source: Outcoming edges are sorted from lightest to heaviest for each vertex.
cs_cz: Hrany vycházející z vrcholu jsou setříděny od nejlehčí po nejtěžší pro každý vrchol.

source: Outside
cs_cz: Mimo

# PathDoesntExist
source: Path from source to sink in the net of reserves doesn't exist.
cs_cz: Cesta od zdroje ke stoku v síti rezerv neexistuje.

# Print
source: Print graph
cs_cz: Vytisknout graf

# ProblemReading
source: There is some problem with reading this file. Please, try it again.
cs_cz: Objevil se problém s načítáním tohoto souboru. Zkuste to prosím znovu.

# RelaxAlgo
source: Relaxation algorithm
cs_cz: Relaxační algoritmus

# RemovedFromReserveNet
source: is removed from the network of reserves.
cs_cz: už není v síti rezerv.

# RemovingBackEdges
source: Removing every edge to previous layers or edges inside layers...
cs_cz: Odstranění všech hran vedoucích do předešlých vrstev nebo hran uvnitř vrstev…

# RemovingFarVertices
source: Removing every vertex which is further from source than sink...
cs_cz: Odstranění všech vrcholů vzdálenějších od zdroje než stok…

# RemovingNoOutVertices
source: Removing vertices with no outcoming edges...
cs_cz: Odstranění všech slepých uliček…

source: Removing saturated edges...
cs_cz: Odstranění nasycencýh hran…

source: Run
cs_cz: Spustit

# Save
source: Save graph
cs_cz: Uložit graf

# SearchingPath
source: Looking for a path from source to sink using BFS algorithm...
cs_cz: Hledání cesty ze zdroje do stoku prohledáváním do šířky…

# SelectedAlgoRunning
source: Selected algorithm is running.
cs_cz: Vybraný algoritmus běží.

# SelectInit
source: Select the initial vertex. Then press green Done button.
cs_cz: Vyberte počáteční vrchol. Poté stiskněte zelené tlačítko Hotovo.

# SelectSink
source: Select the sink vertex and press Done again.
cs_cz: Vyberte stok a pak stiskněte Hotovo.

# SelectSource
source: Select the source vertex. Then press green Done button.
cs_cz: Vyberte zdroj. Poté stiskněte zelené tlačítko Hotovo.

# ShortestPathContains
source: The shortest path from source to sink conatins
cs_cz: Nejkratší cesta od zdroje ke stoku obsahuje

# SinkNotReachable
source: The sink is not reachable from the source.
cs_cz: Stok je ze zdroje nedostupný.

# SortedNeighbours
source: Sorted neighbours are (rating is in parenthesses):
cs_cz: Setříděné sousední vrcholy jsou (jejich ohodnocení je v závorkách):

# SpaceEdges
source: edges.
cs_cz: hran(y).

source: Time complexity:
cs_cz: Časová složitost:

source: Transfering surplus...
cs_cz: Převádění přebytku…

source: Tutorial
cs_cz: Tutoriál

source: Unvisited
cs_cz: Nenalezený

# VertexHash
source: Vertex #
cs_cz: Vrchol #

# VerticesInicialized
source: Vertices are initialized...
cs_cz: Inicializace vrcholů…

# VerticisSurplus
source: Vertices with positive surplus are staying marked.
cs_cz: Vrcholy s kladným přebytkem zůstávají označeny.

# Welcome
source: Welcome to Cepheus. Feel free to create any graphs you want and experiment with the prepared algorithms. If you're using this app for the first time, there's a tutorial made right for you in the upper right corner.
cs_cz: Vítejte v aplikaci Cepheus. Zde můžete vytvářet jakékoli grafy a zkoumat na nich, jak fungují nejrůznější algoritmy z naší nabídky. Pokud nevíte jak začít, tak v pravém hroním rohu najdete krátký tutoriál.

# WithPred
source: with predecessor
cs_cz: s předchůdcem

source: with rating:
cs_cz: s ohodnocením:

source: Zoom in
cs_cz: Přiblížit

source: Zoom out
cs_cz: Oddálit
